#ЗАДАЧА Begin17◦
#a = int(input("ведите координату первой точки:"))
#b = int(input("ведите координату второй точки:"))
#c = int(input("ведите координату третьей точки:"))
#x = abs(c - a)
#y = abs(c - b)
#z = x + y
#print("длинна отрезка ac:" + str(x) + "длинна отрезка bc:" + str(y) + "сумма отрезков равна :" + str(z) )

#ЗАДАЧА Begin29◦
#p = 3.14
#a = int(input("ведите градус (0<a<360):"))
#n = p * a / 180
#print("Значение угла в радианах" + str(n))

#ЗАДАЧА Integer 6◦
#i = int(input("ведите двузначное число:"))
#x = i // 10
#z = i % 10
#print("Левая цифра числа:" + str(x))
#print("Правая цифра числа:" + str(z))

#ЗАДАЧА Integer 7◦
#i = int(input("ведите двузначное число:"))
#x = i // 10
#z = i % 10
#print("сумма цифр числа:" + str(z + x))
#print("произведение цифр числа:" + str(z * x))
